package pkg05;

public class Note {

	/*
	 
	 중첩 for 구문 : 2개 이상의 for 구문을 중첩하여 사용하는 구문.
	 	특징 및 주의사항 : 
	 				  행(row) : 외부에 있는 for	
	 	 			  열(column) : 내부에 있는 for
	 	 			  
	 	 			  제어 변수는 통상적으로 i, j로 사용함.
	 	 			  i와 j를 혼동하여 사용하면 안됨.
	 
	 배열 : 동일한 타입의 데이터를 메모리에 연속적으로 나열해준 데이터.
	 	   배열의 3가지 요소 : 배열의 이름, 타입, 요소의 개수
	       배열의 선언 방법 (new 연산자) : 타입[] 배열이름 = new 타입[크기];
	 			         			int[] exam = new int[20];
	 			         			String[] soshi = new String[9];
	 	   배열의 선언 방법 (초기화 기법) : 타입[] 배열이름 = {값1, 값2, 값3 ...}
	 	   	         				String[] soshi = {"태연", "효연", "티파니"}; // 값이 정확히 정해져 있을 때 사용.
	 	   배열의 특징 : 	배열의 요소 번호는 0부터 시작
	 	   	         	요소를 접근하고자 할 때 대괄호를 사용함.
	 	   	         	요소 1개는 변수 1개와 동급 레벨임.
	 	   	         	요소의 개수는 배열이름.length라는 메소드를 사용하면 됨.
	 	   	         	** 자바에서 대괄호가 나오면 무조건 배열임.
	 	   배열의 장단점 : 	변수 1개로 표현이 되며, 반복문(for 구문)이 가능함.
	 					크기가 정해지고 나면 더 이상 수정이 불가능함. 
	 	   배열의 초기 값 : 일반 변수와는 다르게 배열은 타입마다 디폴트 초기 값이 존재함.
	 	   				byte, short, int, long : 0 
	 	   				float, doble : 0.0
	 	   				char (공백 문자), boolean (false)
	 	   				참고 자료형 (null) 	
	 		
	 		
	 */
}
